{"module": "keras", "class_name": "Sequential", "config": {"name": "sequential_63", "trainable": true, "dtype": "float32", "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 384], "dtype": "float32", "sparse": false, "name": "input_layer_63"}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_252", "trainable": true, "dtype": "float32", "units": 152, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0020767704433677613}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_189", "trainable": true, "dtype": "float32", "rate": 0.45703519227860273, "seed": null, "noise_shape": null}, "registered_name": null, "build_config": {"input_shape": [null, 152]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_253", "trainable": true, "dtype": "float32", "units": 152, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0020767704433677613}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 152]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_190", "trainable": true, "dtype": "float32", "rate": 0.45703519227860273, "seed": null, "noise_shape": null}, "registered_name": null, "build_config": {"input_shape": [null, 152]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_254", "trainable": true, "dtype": "float32", "units": 152, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0020767704433677613}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 152]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_191", "trainable": true, "dtype": "float32", "rate": 0.45703519227860273, "seed": null, "noise_shape": null}, "registered_name": null, "build_config": {"input_shape": [null, 152]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_255", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 152]}}], "build_input_shape": [null, 384]}, "registered_name": null, "build_config": {"input_shape": [null, 384]}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010677482932806015, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": "sparse_categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}